OpenEPaperLink/Tag_FW_EFR32xG22/firmware/oepl_hw_abstraction.c
  if(tagconfig->debug->type != DBG_SWO) {
    // Stop messing with the SWO pin as we may be reusing it somewhere else
    GPIO_DbgSWOEnable(false);
    GPIO_PinModeSet((GPIO_Port_TypeDef)GPIO_SWV_PORT, GPIO_SWV_PIN, gpioModeDisabled, 0);
  }

  if(tagconfig->debug->type != DBG_EUART) {
    // Turn off EUART when not in use to avoid it taking control over pins it shouldn't
    extern sl_iostream_uart_t *sl_iostream_uart_euart_debug_handle;
    sl_iostream_uart_deinit(sl_iostream_uart_euart_debug_handle);
  }

  // Set the requested debug print output
  switch(tagconfig->debug->type)
  {
    case DBG_SWO:
      sl_iostream_set_system_default(sl_iostream_instance_swo_info.handle);
      break;
    #if SL_CATALOG_IOSTREAM_RTT_PRESENT
    case DBG_RTT:
      sl_iostream_set_system_default(sl_iostream_instance_rtt_info.handle);
      break;
    #endif
    case DBG_EUART:
      // Adjust the pinout for the EUART
      GPIO_PinModeSet(tagconfig->debug->output.euart.tx.port, tagconfig->debug->output.euart.tx.pin, gpioModePushPull, 1);

      GPIO->EUARTROUTE->TXROUTE = (tagconfig->debug->output.euart.tx.port << _GPIO_EUART_TXROUTE_PORT_SHIFT)
                                | (tagconfig->debug->output.euart.tx.pin << _GPIO_EUART_TXROUTE_PIN_SHIFT);
      if(tagconfig->debug->output.euart.rx.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->debug->output.euart.rx.port, tagconfig->debug->output.euart.rx.pin, gpioModeInput, 0);
        GPIO->EUARTROUTE->RXROUTE = (tagconfig->debug->output.euart.rx.port << _GPIO_EUART_RXROUTE_PORT_SHIFT)
                                  | (tagconfig->debug->output.euart.rx.pin << _GPIO_EUART_RXROUTE_PIN_SHIFT);
      }

      if(tagconfig->debug->output.euart.enable.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->debug->output.euart.enable.port, tagconfig->debug->output.euart.enable.pin, gpioModePushPull, 1);
      }

      sl_iostream_set_system_default(sl_iostream_instance_euart_debug_info.handle);
      break;
    default:
      DPRINTF("Unrecognised debug output\n");
      while(1) {
        sl_power_manager_sleep();
      }
  }

  // Now that we have debug output, log a message if we're coming back from a HW error
  uint32_t resetCause = RMU_ResetCauseGet();
  RMU_ResetCauseClear();

  if (resetCause & EMU_RSTCAUSE_WDOG0) {
    DPRINTF("*** Rebooted due to catching a hardware fault ***\n");
  }

  CMU_ClockEnable(cmuClock_WDOG0, true);
  CMU_ClockSelectSet(cmuClock_WDOG0, cmuSelect_ULFRCO);

  // Setup flash
  if(tagconfig->hwtype == BRD4402B_WSTK ||
     tagconfig->hwtype == BRD4402B_WSTK_EPD ||
     tagconfig->hwtype == MODCHIP_HD150) {
    is_devkit = true;
    //oepl_hw_flash_deepsleep();
  }
  
  // Setup pins
  if(tagconfig->gpio) {
    if(tagconfig->gpio->button1.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->gpio->button1.port, tagconfig->gpio->button1.pin, gpioModeInputPullFilter, 1);
      button1_hwval = 0x80 | tagconfig->gpio->button1.port << 4| tagconfig->gpio->button1.pin;
    } else {
      button1_hwval = 0;
    }

    if(tagconfig->gpio->button2.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->gpio->button2.port, tagconfig->gpio->button2.pin, gpioModeInputPullFilter, 1);
      button2_hwval = 0x80 | tagconfig->gpio->button2.port << 4| tagconfig->gpio->button2.pin;
    } else {
      button2_hwval = 0;
    }

    if(tagconfig->gpio->gpio.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->gpio->gpio.port, tagconfig->gpio->gpio.pin, gpioModeInput, 1);
      gpio_hwval = 0x80 | tagconfig->gpio->gpio.port << 4 | tagconfig->gpio->gpio.pin;
    } else {
      gpio_hwval = 0;
    }

    if(tagconfig->gpio->nfc_fd.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->gpio->nfc_fd.port, tagconfig->gpio->nfc_fd.pin, gpioModeInput, 0);
      nfcfd_hwval = 0x80 | tagconfig->gpio->nfc_fd.port << 4| tagconfig->gpio->nfc_fd.pin;
    } else {
      nfcfd_hwval = 0;
    }

    nfcpwr_hwval = 0;
    nfcsda_hwval = 0;
  } else {
    button1_hwval = 0;
    button2_hwval = 0;
    gpio_hwval = 0;
    nfcfd_hwval = 0;
    nfcpwr_hwval = 0;
    nfcsda_hwval = 0;
  }

  // Setup led(s)
  if(tagconfig->led) {
    if(tagconfig->led->white.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->led->white.port, tagconfig->led->white.pin, gpioModePushPull, 1);
      white_hwval =  0x80 | tagconfig->led->white.port << 4| tagconfig->led->white.pin;
    } else {
      white_hwval = 0;
    }
    if(tagconfig->led->red.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->led->red.port, tagconfig->led->red.pin, gpioModePushPull, 1);
      red_hwval =  0x80 | tagconfig->led->red.port << 4| tagconfig->led->red.pin;
    } else {
      red_hwval = 0;
    }
    if(tagconfig->led->green.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->led->green.port, tagconfig->led->green.pin, gpioModePushPull, 1);
      green_hwval =  0x80 | tagconfig->led->green.port << 4| tagconfig->led->green.pin;
    } else {
      green_hwval = 0;
    }
    if(tagconfig->led->blue.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->led->blue.port, tagconfig->led->blue.pin, gpioModePushPull, 1);
      blue_hwval =  0x80 | tagconfig->led->blue.port << 4| tagconfig->led->blue.pin;
    } else {
      blue_hwval = 0;
    }
  } else {
    white_hwval = 0;
    red_hwval = 0;
    green_hwval = 0;
    blue_hwval = 0;
  }

  // Setup NFC is done ad-hoc since it may involve power up/down of the NFC chip
  if(tagconfig->nfc) {
    if(oepl_nfc_init()) {
      nfcpwr_hwval = 0x80 | (tagconfig->nfc->power.port << 4) | tagconfig->nfc->power.pin;
      nfcsda_hwval = 0x80 | (tagconfig->nfc->SDA.port << 4) | tagconfig->nfc->SDA.pin;
    }
  }

  // Setup power manager infrastructure
  sl_power_manager_subscribe_em_transition_event(&event_handle, &event_info);

  // Setup application NVM
  oepl_nvm_status_t status = oepl_nvm_init_default();
  if(status == NVM_ERROR) {
    // Clean our slate
    DPRINTF("Need to autodetect, lost NVM\n");
    oepl_nvm_factory_reset(oepl_efr32xg22_get_oepl_hwid());
  }

  if(oepl_nvm_setting_get(OEPL_HWID, &hwid, sizeof(hwid)) != NVM_SUCCESS) {
    // Clean our slate
    DPRINTF("Need to autodetect, lost NVM\n");
    oepl_nvm_factory_reset(oepl_efr32xg22_get_oepl_hwid());
  }

  // Cache our HWID
  oepl_nvm_setting_get(OEPL_HWID, &hwid, sizeof(hwid));
  DPRINTF("Hello OEPL tag type 0x%02x\n", hwid);

  size_t slots, slot_size;
  oepl_nvm_get_num_img_slots(&slots, &slot_size);
  DPRINTF("Have %d image slots of %d bytes\n", slots, slot_size);

  // Setup display
  oepl_efr32xg22_displayparams_t displayconfig;
  bool is_valid = oepl_efr32xg22_get_displayparams(&displayconfig);
  if(!is_valid) {
    DPRINTF("Error: no valid display configuration\n");
    while(1) {
      sl_power_manager_sleep();
    }
  }

  oepl_display_init(&displayconfig);
}

