OpenEPaperLink/Tag_FW_EFR32xG22/firmware/oepl_hw_abstraction.c
    // Start IADC conversion
    IADC_command(IADC0, iadcCmdStartSingle);

    // Wait for conversion to be complete
    while((IADC0->STATUS & (_IADC_STATUS_CONVERTING_MASK
                | _IADC_STATUS_SINGLEFIFODV_MASK)) != IADC_STATUS_SINGLEFIFODV);

    // Get ADC result
    uint32_t sample = IADC_pullSingleFifoResult(IADC0).data;
    voltage_reading_cache = ((sample * 4 * 1200) / 4095);

    IADC_command(IADC0, iadcCmdStopSingle);
    IADC_reset(IADC0);
    CMU_ClockEnable(cmuClock_IADC0, false);
    
    last_measurement_ticks = sl_sleeptimer_get_tick_count();
    DPRINTF("Supply voltage %d mv\n", voltage_reading_cache);

    uint16_t lowbat_voltage;
    if(oepl_nvm_setting_get(OEPL_LOWBAT_VOLTAGE_MV, &lowbat_voltage, sizeof(lowbat_voltage)) == NVM_SUCCESS) {
      if(voltage_reading_cache <= lowbat_voltage) {
        oepl_display_set_overlay(ICON_LOW_BATTERY, true);
      } else {
        oepl_display_set_overlay(ICON_LOW_BATTERY, false);
      }
    }
  }
  *voltage_mv = voltage_reading_cache;
  return true;
}

uint8_t oepl_hw_get_hwid(void)
{
  return hwid;
}

uint8_t oepl_hw_get_capabilities(void)
{
  return oepl_efr32xg22_get_oepl_hwcapa(); 
}

uint16_t oepl_hw_get_swversion(void)
{
  extern char linker_vectors_begin;
  void** vtable = (void*)(&linker_vectors_begin);

  ApplicationProperties_t* appinfo_p = (ApplicationProperties_t*)vtable[13];
  if(appinfo_p != NULL) {
    return appinfo_p->app.version;
  } else {
    return SL_APPLICATION_VERSION;
  }
}

const char* oepl_hw_get_swsuffix(void)
{
#if defined(GIT_COMMIT_ID)
  return GIT_COMMIT_ID;
#else
  return "Dev";
#endif
}

bool oepl_hw_nfc_write_url(const uint8_t* url_buffer, size_t length)
{
  return oepl_nfc_write_url(url_buffer, length);
}

bool oepl_hw_nfc_write_raw(const uint8_t* raw_buffer, size_t length)
{
  return oepl_nfc_write_raw(raw_buffer, length);
}

static void deepsleep_timer_cb(sl_sleeptimer_timer_handle_t *handle, void *data)
{
  (void) handle;
  (void) data;
  if(RAIL_GetRadioState(sl_rail_util_get_handle(SL_RAIL_UTIL_HANDLE_INST0)) & RAIL_RF_STATE_IDLE) {
    // Waking up from EM4 will take us through reset, so set all interface pins back to idle state here.
    const oepl_efr32xg22_tagconfig_t* tagconfig = oepl_efr32xg22_get_config();
    if(tagconfig->debug && tagconfig->debug->type == DBG_EUART) {
      GPIO_PinModeSet(tagconfig->debug->output.euart.tx.port, tagconfig->debug->output.euart.tx.pin, gpioModeDisabled, 1);
      if(tagconfig->debug->output.euart.rx.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->debug->output.euart.rx.port, tagconfig->debug->output.euart.rx.pin, gpioModeDisabled, 1);
      }
      if(tagconfig->debug->output.euart.enable.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->debug->output.euart.enable.port, tagconfig->debug->output.euart.enable.pin, gpioModeDisabled, 1);
      }
    }

    // Turn off LEDs
    if(tagconfig->led) {
      if(tagconfig->led->white.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->led->white.port, tagconfig->led->white.pin, gpioModeDisabled, 1);
      }
      if(tagconfig->led->red.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->led->red.port, tagconfig->led->red.pin, gpioModeDisabled, 1);
      }
      if(tagconfig->led->blue.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->led->blue.port, tagconfig->led->blue.pin, gpioModeDisabled, 1);
      }
      if(tagconfig->led->green.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->led->green.port, tagconfig->led->green.pin, gpioModeDisabled, 1);
      }
    }

    // Enter EM4
    EMU_EM4Init_TypeDef em4init;
    em4init.em4State = emuEM4Shutoff;
    em4init.retainLfxo = false;
    em4init.retainLfrco = false;
    em4init.retainUlfrco = false;
    em4init.pinRetentionMode = emuPinRetentionEm4Exit;

    uint32_t em4mask = 0;
    if(tagconfig->gpio) {
      em4mask |= tagconfig->gpio->button1_em4wuval;
      em4mask |= tagconfig->gpio->button2_em4wuval;
      em4mask |= tagconfig->gpio->nfc_fd_em4wuval;
    }

    DPRINTF("Wakeup mask from EM4: 0x%08lx\n", em4mask);

    EMU_EM4Init(&em4init);
    GPIO_EM4EnablePinWakeup(em4mask, 0);
    EMU_EnterEM4();
  } else {
    // Postpone 5 more ms
    sl_sleeptimer_start_timer_ms(&deepsleep_entry_timer_handle,
                               5, deepsleep_timer_cb,
                               NULL, 0, SL_SLEEPTIMER_NO_HIGH_PRECISION_HF_CLOCKS_REQUIRED_FLAG);
  }
}

void oepl_hw_enter_deepsleep(void)
{
  if(is_devkit) {
    sl_mx25_flash_shutdown();
  }
  // Todo: cut power to the EPD if possible
  // Todo: cut power to the NFC if possible

  sl_sleeptimer_start_timer_ms(&deepsleep_entry_timer_handle,
                               5, deepsleep_timer_cb,
                               NULL, 0, SL_SLEEPTIMER_NO_HIGH_PRECISION_HF_CLOCKS_REQUIRED_FLAG);
}

bool oepl_hw_get_screen_properties(size_t* x, size_t* y, size_t* bpp)
{
  oepl_efr32xg22_displayparams_t displayparams;
  bool retval = oepl_efr32xg22_get_displayparams(&displayparams);
  if(retval) {
    *x = displayparams.xres;
    *y = displayparams.yres;
    *bpp = 1 + (displayparams.have_thirdcolor ? 1 : 0);
  }
  return retval;
}

bool oepl_hw_get_screen_controller(uint8_t* controller_type)
{
  oepl_efr32xg22_displayparams_t displayparams;
  bool retval = oepl_efr32xg22_get_displayparams(&displayparams);
  if(retval) {
    *controller_type = displayparams.ctrl;
  }
  return retval;
}

// ----------------------- External flash --------------------------------------
void oepl_hw_flash_deepsleep(void)
{
  if(is_devkit) {
    sl_mx25_flash_shutdown();
  }
}

void oepl_hw_flash_wake(void)
{
  if(is_devkit) {
    CMU_ClockEnable(cmuClock_GPIO, true);
    GPIO_PinModeSet(SL_MX25_FLASH_SHUTDOWN_CS_PORT, SL_MX25_FLASH_SHUTDOWN_CS_PIN, gpioModePushPull, 1);
    // Wake up flash in case the device is in deep power down mode already.
    GPIO_PinOutClear(SL_MX25_FLASH_SHUTDOWN_CS_PORT, SL_MX25_FLASH_SHUTDOWN_CS_PIN);
    sl_udelay_wait(20);                  // wait for tCRDP=20us
    GPIO_PinOutSet(SL_MX25_FLASH_SHUTDOWN_CS_PORT, SL_MX25_FLASH_SHUTDOWN_CS_PIN);
    sl_udelay_wait(35);                  // wait for tRDP=35us
    GPIO_PinModeSet(SL_MX25_FLASH_SHUTDOWN_CS_PORT, SL_MX25_FLASH_SHUTDOWN_CS_PIN, gpioModeDisabled, 1);
  }
}

